Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraintData.RestraintTypeEnum Enumeration
 Defines all the restraint types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RestraintTypeEnum
Public Enumeration RestraintTypeEnum
Members
Member name | Value | Description
NOT_DEFINED | -3 |  The restraint type is not defined.
PARTIAL_RELEASE | -2 |  The partial release type.
FIXED | -1 |  The fixed release type.
FREE | 0 |  The free release type.
SPRING | 1 |  The spring release type.
See Also
Reference
Tekla.Structures.Analysis Namespace